/**
 *******************************************************************************
 * @copyright 2017-2020, Electronic Technology Co. Ltd
 * @file      flash.c
 * @version   V1.0.0
 * @brief     
 * @warning   
 *******************************************************************************
 * @remarks
 * 1. Version                Date                 Author
 *    v1.0.0                 2020年1月1日          Unknown
 *    Modification: 创建文档
 *******************************************************************************
 */
/* NEED FIX */
/*******************************************************************************
 *                 Include File Section ('#include')
 ******************************************************************************/
#include "N79E81x.h"
#include "flash.h"


/*******************************************************************************
 *                 Macro Define Section ('#define')
 ******************************************************************************/

/*******************************************************************************
 *                 Struct Define Section ('typedef')
 ******************************************************************************/

/*******************************************************************************
 *                 Normal Prototype Declare Section ('function')
 ******************************************************************************/

/*******************************************************************************
 *                 File Static Prototype Declare Section ('static function')
 ******************************************************************************/

/*******************************************************************************
 *                 Global Variable Declare Section ('variable')
 ******************************************************************************/

/*******************************************************************************
 *                 File Static Variable Define Section ('static variable')
 ******************************************************************************/

/*******************************************************************************
 *                 Normal Function Define Section ('function')
 ******************************************************************************/
/* 打开ISP模式 */
void Enable_ISP_Mode(void)
{
    /* Record EA Status */
    EA_save_bit = EA;
    /* 关闭全局中断 */
    EA = 0;

    /* 关键SFR读写保护 */
    TA = 0xAA;
    TA = 0x55;
    /* 将ISPEN置1 开启ISP功能 
        - 使能ISP功能将以内部的22.1184MHz RC 振荡器为时钟
        - 清ISPEN应该是ISP操作后的最后一条指令 这样可以停止内部RC以减少功耗
        */
    CHPCON |= 0x01;
    /* Resume EA */
    EA = EA_save_bit;
}

/* 关闭ISP模式 */
void Disable_ISP_Mode(void)
{
    /* Disable ISP */
    /* Record EA Status */
    EA_save_bit = EA;
    /* 关闭全局中断 */
    EA = 0;

    /* ISP 功能的关键SFR读写保护 */
    TA = 0xAA;
    TA = 0x55;
    /* 将ISPEN置0 关闭ISP功能 
        - 使能ISP功能将以内部的22.1184MHz RC 振荡器为时钟
        - 清ISPEN应该是ISP操作后的最后一条指令 这样可以停止内部RC以减少功耗
        */
    CHPCON &= 0xFE;
    /* Resume EA */
    EA = EA_save_bit;
}

/* 触发ISP功能 以执行ISP指令 */
void Trigger_ISP(void)
{
    /* Record EA Status */
    EA_save_bit = EA;
    /* 关闭全局中断 */
    EA = 0;

    /* ISP 功能的关键SFR读写保护 */
    TA = 0xAA;
    TA = 0x55;
    /* ISPGO -> ISPTRG[0] 置位 执行ISP
        - 设置该位为1开始执行ISP 该指令后 CPU保持程序计数器PC ISP硬件自动管理控制该过程
        - ISP完成后 程序计数器继续执行 ISPGO位自动清零 保持为0
        */
    ISPTRG |= 0x01;
    /* Resume EA */
    EA = EA_save_bit;
}

/*******************************************************************************
 *                 File Static Function Define Section ('static function')
 ******************************************************************************/

/*******************************************************************************
 *                 End of File ('EOF')
 ******************************************************************************/
